Revit 2027 API
ElementDesignOptionFilter Constructor
Overload List
Name | Description
ElementDesignOptionFilter(ElementId) |  Constructs a new instance of a filter to match elements contained within a particular design option.
ElementDesignOptionFilter(ElementId, Boolean) |  Constructs a new instance of a filter to match elements contained within a particular design option, with the option to invert the filter and find elements not contained within a particular design option.
Top
See Also
Reference
ElementDesignOptionFilter Class
Autodesk.Revit.DB Namespace